## Handling missing Data

In [1]:
import numpy as np

import pandas as pd

import os as o

import sys as ss

import csv as cv

import json as jayz

#import lxml as xml Not working ecen though it is installed


import requests

import sqlite3

# import sqlalchemy as sqa , not working even though installed


import re

In [2]:
float_data = pd.Series([1,333.266,np.nan,33262])

float_data

0        1.000
1      333.266
2          NaN
3    33262.000
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data = pd.Series(['sgdgs','aaha',None,'raja',np.nan])

string_data

0    sgdgs
1     aaha
2     None
3     raja
4      NaN
dtype: object

In [5]:
string_data.isna()

0    False
1    False
2     True
3    False
4     True
dtype: bool

### Filtering Out Missing Data

In [6]:
datar = pd.Series([1,3344,None,22553.261,np.nan,323])

datar.dropna()

0        1.000
1     3344.000
3    22553.261
5      323.000
dtype: float64

In [7]:
dataq = pd.DataFrame([[1,8.553,2.],[1,np.nan,np.nan],
                     [np.nan,np.nan,np.nan],[np.nan,7.33,3]]
                    )

dataq

     0      1    2
0  1.0  8.553  2.0
1  1.0    NaN  NaN
2  NaN    NaN  NaN
3  NaN  7.330  3.0

In [8]:
dataq.dropna()

     0      1    2
0  1.0  8.553  2.0

In [9]:
dataq.dropna(how = 'all')  # This will drop rows that are all NA

     0      1    2
0  1.0  8.553  2.0
1  1.0    NaN  NaN
3  NaN  7.330  3.0

In [10]:
dataq['aa'] = 3

In [11]:
dataq = dataq.drop(columns = 'aa')

In [12]:
dataq[4] = np.nan

In [13]:
dataq

     0      1    2   4
0  1.0  8.553  2.0 NaN
1  1.0    NaN  NaN NaN
2  NaN    NaN  NaN NaN
3  NaN  7.330  3.0 NaN

In [14]:
dataq.dropna(how = 'all',axis = 'columns')

     0      1    2
0  1.0  8.553  2.0
1  1.0    NaN  NaN
2  NaN    NaN  NaN
3  NaN  7.330  3.0

### If you want to show few number of NAN do like

In [15]:
df = pd.DataFrame(np.random.standard_normal((7,3)))

df

          0         1         2
0 -0.170800  0.445630  0.530779
1  0.672590 -1.672733 -1.279841
2 -0.901987 -0.472300  0.993764
3 -0.592836  0.752147  0.868656
4  0.310584  0.040337 -0.472298
5 -0.780694 -0.785953 -1.405317
6  0.178345  1.060868  2.241134

In [16]:
df.iloc[:4,1] = np.nan

In [17]:
df.iloc[:2,2] = np.nan

In [18]:
df

          0         1         2
0 -0.170800       NaN       NaN
1  0.672590       NaN       NaN
2 -0.901987       NaN  0.993764
3 -0.592836       NaN  0.868656
4  0.310584  0.040337 -0.472298
5 -0.780694 -0.785953 -1.405317
6  0.178345  1.060868  2.241134

In [19]:
df.dropna(thresh = 1) # It's not working as expected

          0         1         2
0 -0.170800       NaN       NaN
1  0.672590       NaN       NaN
2 -0.901987       NaN  0.993764
3 -0.592836       NaN  0.868656
4  0.310584  0.040337 -0.472298
5 -0.780694 -0.785953 -1.405317
6  0.178345  1.060868  2.241134

In [20]:
df.dropna(thresh = 2)

          0         1         2
2 -0.901987       NaN  0.993764
3 -0.592836       NaN  0.868656
4  0.310584  0.040337 -0.472298
5 -0.780694 -0.785953 -1.405317
6  0.178345  1.060868  2.241134

In [21]:
df[3] = np.nan

In [22]:
df

          0         1         2   3
0 -0.170800       NaN       NaN NaN
1  0.672590       NaN       NaN NaN
2 -0.901987       NaN  0.993764 NaN
3 -0.592836       NaN  0.868656 NaN
4  0.310584  0.040337 -0.472298 NaN
5 -0.780694 -0.785953 -1.405317 NaN
6  0.178345  1.060868  2.241134 NaN

In [23]:
df.dropna(thresh = 3) # utna nahi samjh  rha, like basically agar usse 2 ka mila toh drop kardega, varna agar usse zyada wala
# jitna rahega utna drop kar dega

          0         1         2   3
4  0.310584  0.040337 -0.472298 NaN
5 -0.780694 -0.785953 -1.405317 NaN
6  0.178345  1.060868  2.241134 NaN

In [24]:
df.iloc[3:,3] = 90

In [25]:
df

          0         1         2     3
0 -0.170800       NaN       NaN   NaN
1  0.672590       NaN       NaN   NaN
2 -0.901987       NaN  0.993764   NaN
3 -0.592836       NaN  0.868656  90.0
4  0.310584  0.040337 -0.472298  90.0
5 -0.780694 -0.785953 -1.405317  90.0
6  0.178345  1.060868  2.241134  90.0

In [26]:
df.dropna(thresh = 3)

          0         1         2     3
3 -0.592836       NaN  0.868656  90.0
4  0.310584  0.040337 -0.472298  90.0
5 -0.780694 -0.785953 -1.405317  90.0
6  0.178345  1.060868  2.241134  90.0

### Filling the missing data

In [27]:
df.fillna(0)

          0         1         2     3
0 -0.170800  0.000000  0.000000   0.0
1  0.672590  0.000000  0.000000   0.0
2 -0.901987  0.000000  0.993764   0.0
3 -0.592836  0.000000  0.868656  90.0
4  0.310584  0.040337 -0.472298  90.0
5 -0.780694 -0.785953 -1.405317  90.0
6  0.178345  1.060868  2.241134  90.0

In [28]:
dict_for_column_filling = {1:'aaj',2:'raat',3:'done'}

In [29]:
df.fillna(dict_for_column_filling)

          0         1         2     3
0 -0.170800       aaj      raat  done
1  0.672590       aaj      raat  done
2 -0.901987       aaj  0.993764  done
3 -0.592836       aaj  0.868656  90.0
4  0.310584  0.040337 -0.472298  90.0
5 -0.780694 -0.785953 -1.405317  90.0
6  0.178345  1.060868  2.241134  90.0

In [30]:
# You can fill up with other also

In [31]:
df.fillna(df.mean()) # this will fill the mean of column wise, like the mean of 3rd col is 90, do 90 will come in place of Nan

          0         1         2     3
0 -0.170800  0.105084  0.445188  90.0
1  0.672590  0.105084  0.445188  90.0
2 -0.901987  0.105084  0.993764  90.0
3 -0.592836  0.105084  0.868656  90.0
4  0.310584  0.040337 -0.472298  90.0
5 -0.780694 -0.785953 -1.405317  90.0
6  0.178345  1.060868  2.241134  90.0

## Data Transformation

### Removing Duplicates

In [32]:
data = pd.DataFrame({'k0':['ek','do']*3 + ['do'],
                    
                    'k1':[1,1,2,3,3,4,4]
                    })

data

   k0  k1
0  ek   1
1  do   1
2  ek   2
3  do   3
4  ek   3
5  do   4
6  do   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data.drop_duplicates()

   k0  k1
0  ek   1
1  do   1
2  ek   2
3  do   3
4  ek   3
5  do   4

In [35]:
# Important note, by default both the functions run on all the columns and they work by checking if the entire combination

# of all the rows under all the columns are duplicate or not

In [36]:
data['pappi'] = range(7)

In [37]:
data

   k0  k1  pappi
0  ek   1      0
1  do   1      1
2  ek   2      2
3  do   3      3
4  ek   3      4
5  do   4      5
6  do   4      6

In [38]:
data.drop_duplicates(subset = 'k0') # if you want to check running only on one column

   k0  k1  pappi
0  ek   1      0
1  do   1      1

### Transforming data using function or mapping

In [39]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','pastrami','corned beef','bacon','pastrami','honey ham','nova lox'],
                   
                   'ounces':[4,3,12,6,7.8,8,3,5,6]}
                   )

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.8
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [40]:
# Suppose you want to map the meat to the animal it came from, do it like this

In [41]:
mapdict = {'bacon':'pig',
           'pulled pork' : 'pig',   
          'pastrami':'cow',
          'corned beef':'cow',
          'honey ham' : 'pig',
          'nova lox':'salmon'          
          }

In [42]:
data['origin'] = data['food'].map(mapdict)

data

          food  ounces  origin
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.8     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

###  Replacing values

In [43]:
dayya = pd.Series([1,2,3.32,-73227,1233,-1000])

dayya

0        1.00
1        2.00
2        3.32
3   -73227.00
4     1233.00
5    -1000.00
dtype: float64

In [44]:
dayya.replace({-73227:0,-1000:0})

0       1.00
1       2.00
2       3.32
3       0.00
4    1233.00
5       0.00
dtype: float64

In [45]:
def func1():
    return 1

In [46]:
#dayya.replace(func1)

### Renaming Axis Indexes

In [47]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['mumbai','kerala','delhi'],
                    
                    columns = ['ek','do','teen','chaar']
                   
                   )

data

        ek  do  teen  chaar
mumbai   0   1     2      3
kerala   4   5     6      7
delhi    8   9    10     11

In [48]:
def Changer(x):
    return x[:3].upper()

In [49]:
data.index.map(Changer)

Index(['MUM', 'KER', 'DEL'], dtype='object')

In [50]:
data.columns.map(Changer)

Index(['EK', 'DO', 'TEE', 'CHA'], dtype='object')

In [51]:
data.index = data.index.map(Changer)

In [52]:
data.columns = data.columns.map(Changer)

In [53]:
data

     EK  DO  TEE  CHA
MUM   0   1    2    3
KER   4   5    6    7
DEL   8   9   10   11

In [54]:
data.rename(index = str.lower,columns = str.title)

     Ek  Do  Tee  Cha
mum   0   1    2    3
ker   4   5    6    7
del   8   9   10   11

In [55]:
data

     EK  DO  TEE  CHA
MUM   0   1    2    3
KER   4   5    6    7
DEL   8   9   10   11

In [56]:
data.rename(index = {'MUM':'aaja'},
           columns = {'EK':'uno'})

      uno  DO  TEE  CHA
aaja    0   1    2    3
KER     4   5    6    7
DEL     8   9   10   11

### Discretization and Binning

In [57]:
# To divide the data into categories

In [58]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [59]:
bins = [18,25,35,60,100]

In [60]:
age_cat = pd.cut(ages,bins)

In [61]:
age_cat

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [62]:
age_cat.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [63]:
age_cat.codes # The output contains the index value of the lower value from age_cat (18, 25] in bins

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [64]:
pd.value_counts(age_cat)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [65]:
# You can also modify the categorizing to string values

In [66]:
age_group = ['baccha','bada','beech umar','sabse samjhdaar'] # order matters, it works in coordination to bins

In [67]:
age_cat = pd.cut(ages,bins,labels = age_group)

In [68]:
age_cat

['baccha', 'baccha', 'baccha', 'bada', 'baccha', ..., 'bada', 'sabse samjhdaar', 'beech umar', 'beech umar', 'bada']
Length: 12
Categories (4, object): ['baccha' < 'bada' < 'beech umar' < 'sabse samjhdaar']

In [69]:
pd.value_counts(age_cat)

baccha             5
bada               3
beech umar         3
sabse samjhdaar    1
dtype: int64

In [70]:
da = np.random.uniform(size = 20)

In [71]:
check = pd.cut(da,4,precision = 3) # If you pass like this, then 4 is irrelevant what cut will do is make equal length bins
# based on maximum and minimum values

check

[(0.0599, 0.289], (0.0599, 0.289], (0.517, 0.745], (0.289, 0.517], (0.745, 0.973], ..., (0.745, 0.973], (0.517, 0.745], (0.289, 0.517], (0.517, 0.745], (0.517, 0.745]]
Length: 20
Categories (4, interval[float64]): [(0.0599, 0.289] < (0.289, 0.517] < (0.517, 0.745] < (0.745, 0.973]]

### Quantiles cut

In [72]:
# qcut is used to obtain more equally sized cuts from the data

In [73]:
data = np.random.standard_normal(1000)

data

array([ 1.17366499e-01, -7.30844865e-01,  5.22200787e-01,  1.52240550e+00,
        4.00515365e-01, -1.73379306e-01, -1.24478361e-01,  1.84735101e+00,
       -1.25691404e-01,  2.48961367e-01,  7.41887085e-01,  1.03473924e+00,
       -3.02041656e-04, -3.74816984e-01,  7.88306271e-01,  1.35434616e+00,
        6.92801088e-01, -4.13456866e-01, -6.87734009e-01, -3.40283752e-01,
        1.57510508e+00, -7.29459568e-02,  4.89499687e-01,  8.24577168e-01,
        5.04676182e-01,  8.56963282e-01,  3.24269022e+00,  1.08438987e-01,
        1.81818050e+00, -7.44575758e-01,  1.57525352e-01, -7.03441141e-01,
       -5.16390906e-01, -1.81077447e+00, -3.64662001e-01, -4.61900751e-01,
       -1.26920173e+00, -1.17823046e+00, -7.94554478e-01,  1.86774155e+00,
        2.36884583e-01,  9.36565902e-02,  1.11929707e+00, -5.31578285e-01,
        1.45442545e+00,  1.61367099e+00,  1.52264424e-01, -1.02753594e+00,
       -2.49973276e+00, -1.39792239e+00,  9.87783183e-01, -1.06567886e+00,
       -4.64403080e-01, -5.28585605e-01,  1.03503451e+00,  1.56897238e+00,
       -1.01662873e+00,  8.04806310e-01, -1.43724665e-02,  2.85617872e-01,
        1.45932239e+00, -2.55815213e+00,  1.76157527e-01,  1.20884281e+00,
       -3.65996633e-01,  1.71855307e+00,  1.27894931e-01,  8.95228059e-01,
        1.81129132e+00, -3.18452448e-01, -3.95478052e-01, -1.18362127e+00,
       -1.96975440e+00,  8.41111329e-01,  4.68531986e-01,  5.60425415e-01,
        1.65929573e+00,  1.18081211e+00,  5.41165018e-02, -7.13176591e-02,
       -1.45185429e-01, -8.13043900e-01,  1.68279511e-01,  9.13305356e-01,
       -1.33781719e+00, -1.07334100e+00, -2.99020690e-01, -7.21338863e-01,
       -8.08634842e-01, -1.05824053e+00,  5.81563717e-01, -8.31160239e-01,
        1.23170870e-01,  1.72610924e+00,  8.52330719e-01, -4.36692949e-01,
        8.82061475e-01, -8.94367558e-01,  1.44586062e+00,  6.34939620e-01,
        1.95667555e+00,  6.49671193e-02,  3.39006643e-01, -2.51874851e-03,
       -9.57039813e-01, -6.71204360e-01,  1.65744102e+00,  3.07034919e-01,
        1.62461346e-01, -1.18749595e-01, -7.75983231e-01, -1.79916691e+00,
       -9.93420689e-01,  2.32680498e-01, -3.63025153e-02, -8.02119106e-02,
       -4.78681801e-01,  4.32170750e-01,  5.91151186e-01,  1.13527266e+00,
        3.28518266e-01,  4.04706559e-02, -4.90732377e-01, -2.18075149e-01,
       -1.66705918e-01,  3.18985647e-01, -2.31871988e-01, -1.32718516e+00,
       -3.38089608e-01, -1.01034800e+00,  1.45359732e+00,  4.19541323e-01,
        5.96799400e-02, -1.32792897e+00, -5.00221301e-01,  9.64448756e-01,
       -9.01570809e-01,  1.44516227e+00,  9.47188976e-01, -9.51588625e-01,
        1.42946644e+00,  9.00008667e-01,  8.08039404e-01, -1.88127354e+00,
        1.15404320e-01, -1.12313313e+00, -6.78364616e-01, -1.53674438e+00,
        2.63558897e+00, -3.84084475e-01, -7.65783690e-01, -4.63836459e-02,
        7.57598175e-01,  1.04208919e+00,  5.05870763e-02,  5.31647774e-01,
        1.49088369e-01,  9.50340292e-01, -1.74635590e+00, -4.32666382e-01,
        1.78848313e+00,  1.33480494e-01, -9.38556937e-01,  1.36407819e+00,
        3.40102801e-01, -1.64480605e+00,  1.30697198e+00, -4.17113146e-01,
       -6.69874604e-01,  1.39239723e+00, -3.70053471e-01,  6.02370408e-01,
        1.23522734e-01, -9.16244504e-01,  1.23698479e-01, -1.11922221e+00,
        5.32675079e-01, -1.56364878e+00, -1.97939936e+00,  1.31125615e+00,
       -9.30957509e-01, -1.41127334e+00, -6.05035863e-01, -1.59774315e+00,
       -1.37931993e+00,  8.41462534e-01, -6.11997087e-01,  1.02517229e+00,
        3.84901810e-01, -1.67246349e+00,  8.91948217e-01,  1.43800640e+00,
        5.95320782e-02,  8.68845606e-01,  2.20515768e+00, -8.90763725e-01,
        5.17953809e-01, -1.66018817e+00, -1.27400504e+00,  9.24393621e-01,
       -1.01132002e+00, -6.25669350e-01,  1.72934065e+00,  1.70544196e+00,
        2.46900811e-01, -3.74170237e-01, -7.30073064e-01,  9.56161108e-01,
       -1.61547561e+00,  1.91793397e-01,  2.36186424e-02,  9.08307258e-01,
        1.22360202e-01,  5.21661121e-01,  1.19980209e-01, -1.50299078e-01,
       -1.30999390e+00, -6.36476370e-01,  2.91317217e-01,  9.91378417e-01,
       -9.95755646e-01, -1.34287613e+00,  5.45691893e-01,  2.48834336e-01,
       -6.61990032e-01, -4.55445927e-02, -2.26023555e+00,  1.40826148e+00,
        2.90358649e-01, -2.57599628e+00,  1.40435674e+00, -2.38120913e-01,
        5.99553499e-01, -1.63600397e-01, -6.32984883e-01,  2.37838403e-01,
        5.97341896e-02, -2.84850373e-01,  7.53553178e-01, -2.33758909e-01,
        1.48962129e-01, -2.31468487e+00, -1.65150827e+00, -1.07563887e+00,
       -4.58692739e-01,  3.18485148e-01,  1.09657245e+00,  6.83621487e-01,
        3.88512367e-01,  1.60381965e-01,  2.52412318e+00, -8.60367267e-01,
       -8.13304357e-01,  1.42586091e-02,  2.62861395e-01,  4.73909142e-01,
       -1.12016344e+00,  1.45593231e+00, -1.29478920e-01,  1.94325736e+00,
        1.67867829e+00,  6.74236984e-01, -6.69633993e-01, -1.08675255e-01,
        1.35837749e+00, -1.95144141e+00,  3.53829836e-01,  8.47438239e-01,
       -6.56421463e-01, -1.54593682e+00,  1.25671779e+00, -1.37490568e+00,
       -1.24760658e-01, -8.69659399e-01,  1.87469611e-01, -1.46309327e-02,
       -5.40997547e-03,  7.66867203e-01, -1.34557685e+00,  1.02708510e+00,
        1.96196724e+00,  2.95402587e-01, -5.20177960e-01, -6.76525133e-01,
        1.03706636e+00,  1.30953943e+00,  1.89218044e-02, -5.22078004e-01,
        9.14090535e-01,  5.47319551e-01,  3.47048128e-02, -1.22873589e+00,
        1.25707448e-01, -2.43624681e-01, -8.55061943e-01, -3.27184433e-01,
        1.56688766e+00, -1.33661816e+00, -3.02780030e-01, -3.63743553e+00,
        3.33860187e-01,  1.92920413e+00,  4.23270234e-01, -4.57753916e-01,
        8.18990377e-01,  5.01172733e-01, -1.36371810e+00, -1.16526402e+00,
        1.40868362e+00, -1.94203270e+00, -1.23669872e+00,  1.15867294e+00,
        5.94550945e-01,  1.93822509e+00,  5.09865795e-01, -2.21042851e+00,
        6.26623767e-01,  2.44076842e-01,  1.05392728e+00, -8.09572423e-01,
        9.82811394e-02,  3.79112702e-01, -3.18214784e-02, -2.98747455e-01,
       -5.79942685e-01, -1.23226776e+00,  9.10052604e-01, -1.32323760e+00,
       -2.67732745e-01, -1.29060821e+00, -1.03768789e+00, -1.52067933e+00,
       -1.17926790e+00,  2.64997283e-02, -1.86864081e+00,  3.81595406e-01,
       -1.57460292e+00, -1.48634771e-01, -5.62290612e-03,  9.58398658e-01,
       -8.31709187e-02, -6.31174682e-01, -8.01795154e-01, -1.14148190e+00,
        9.91541951e-01,  1.13787809e+00, -7.13778654e-01, -2.12404011e-01,
        1.80496224e+00, -3.46993417e-01, -5.91497254e-01,  7.22937127e-01,
       -2.47266776e-02, -5.28546213e-01,  6.63286913e-01, -1.82991379e+00,
       -1.62949423e+00, -2.13817912e-01, -2.85618688e-01, -8.50667470e-01,
       -6.67329708e-01,  5.99172444e-01, -6.43301543e-01, -3.81578286e-01,
        4.56800711e-01,  6.94896872e-01, -8.32015574e-01, -9.92340075e-01,
        5.67170777e-01,  4.38872867e-01, -1.91744145e-02, -4.67701786e-02,
       -4.32096903e-02, -3.22667487e+00,  7.62256508e-01, -8.19109318e-01,
       -1.35221258e-01,  1.32845345e+00, -6.80599930e-01,  3.68670249e-01,
        3.78275187e-01, -1.66232647e+00, -1.25905699e+00,  3.43687823e-01,
       -2.29337299e-01, -9.41679114e-01,  9.34695919e-01, -1.35407095e+00,
        2.50156488e-01, -1.28859738e+00, -2.06488204e-01,  9.05876332e-01,
       -8.23276243e-01,  1.08223280e+00,  9.04856226e-01,  1.43677271e+00,
        5.99757097e-01,  2.41553741e-01, -2.39985931e-01,  4.34690578e-01,
       -1.77883944e+00,  1.22176713e+00, -1.37083269e-01, -1.10772440e+00,
        1.31923780e+00,  1.33128194e+00,  5.64327044e-01,  4.86544804e-01,
        1.28937542e+00,  3.39495871e-01, -3.19908702e-01,  1.90441929e-02,
        1.06528539e+00,  3.05757696e-01, -5.85573127e-01,  1.26200578e+00,
       -5.83419079e-01,  4.17213624e-01, -8.63460522e-01, -1.23537133e+00,
        7.16433209e-01,  1.68842279e+00,  3.38884049e-01, -3.20140332e-01,
        6.79276962e-02,  4.89681302e-01, -8.12078330e-01, -1.03091416e+00,
       -7.14816449e-01,  1.70989486e+00,  1.92022430e-01, -9.59027513e-01,
       -6.75314428e-01, -1.59134174e+00,  9.83770665e-01,  7.62184266e-01,
       -1.69696009e+00,  2.00412939e-01, -4.00834716e-01, -1.37501591e+00,
        2.68134536e-01, -8.79509279e-01,  6.26231441e-01, -7.46574591e-01,
        3.05426920e-01, -2.05281284e+00, -4.62436000e-01, -1.75388425e+00,
        1.12238541e+00, -2.65862609e-01,  1.69870011e+00,  3.92176499e-01,
        8.62991390e-01,  3.77935475e-01,  1.25484619e+00,  1.43329241e+00,
        1.35347451e+00, -8.58218441e-01, -1.26616800e+00,  4.24809221e-01,
        4.47526441e-01,  2.57366626e-01, -1.61410190e+00, -4.78120883e-01,
        8.58300005e-01,  4.61628034e-01, -8.70547124e-01, -1.42707925e+00,
       -1.87128726e+00,  5.68370696e-02,  4.37399280e-01,  3.86401050e-01,
       -1.59118002e+00, -1.14569120e-01, -1.19145525e+00,  5.31631109e-01,
       -1.32842259e+00, -3.78468186e-01,  1.27372444e+00,  6.22845611e-01,
        3.20241507e-01, -5.30830796e-01, -1.60288155e+00, -4.20565886e-01,
        3.28775389e-01,  2.04595485e+00, -3.00479157e-02, -9.86321749e-01,
       -1.82887989e+00,  2.58198525e-01,  9.54286351e-01, -1.54617140e-01,
       -2.47782472e+00, -1.84931672e-01, -6.94479405e-01,  3.09805806e-01,
       -4.08427735e-01, -3.86421906e-01, -6.37248846e-01,  5.65965912e-01,
       -7.64960526e-01, -9.67217096e-01,  1.51359368e+00, -8.58301464e-02,
       -1.05971228e+00, -8.82916027e-02,  1.25818620e+00, -2.50866295e+00,
        3.50533953e-01,  3.84525940e-02, -1.55468886e+00, -1.70696237e-01,
       -3.27584674e-01,  1.68123453e+00, -2.19005920e-01, -9.89679728e-01,
        8.94409599e-01,  1.17936014e+00, -2.84157065e-01, -1.08328322e+00,
        1.50610093e+00, -8.82842627e-02,  5.51244904e-01,  1.05374694e+00,
        1.89838831e+00, -1.72795225e+00, -1.73908858e+00,  1.06797188e+00,
        4.27832203e-01,  7.14821274e-01, -1.13063301e+00,  3.72544159e-01,
        7.53403988e-01,  6.90213372e-01,  1.51639376e+00, -8.69422301e-01,
       -4.33152591e-01,  2.59136297e-01, -9.47232067e-01, -6.61133707e-01,
        1.42811867e-02,  9.92740975e-01,  7.42679211e-01, -7.41360286e-01,
        5.91600473e-01, -1.25163298e+00,  3.49930174e-02,  1.69096898e+00,
        7.18385423e-01,  1.78844963e+00, -6.49714913e-01,  9.76743131e-01,
        9.17142517e-01, -1.50789173e-01,  4.54138455e-01, -8.22492194e-01,
       -4.07720359e-01,  9.78278923e-01, -3.41142657e-01,  2.72714428e-01,
       -8.65925752e-01, -1.62414319e-01,  8.98032138e-01,  6.72217873e-01,
       -6.17349554e-01,  7.48346233e-01,  2.43880400e-01,  1.09776445e+00,
       -4.16579621e-01, -2.34354257e+00, -3.21289921e-01,  3.66849706e-01,
       -3.09877489e-01, -4.80721748e-01,  5.71893306e-01, -1.07867683e+00,
        1.89118393e-01,  1.46730321e+00,  1.73620984e+00, -1.07581182e-01,
        2.01223359e+00,  7.05468631e-01, -9.87489034e-01,  6.00148123e-01,
       -4.72674023e-01, -6.35533250e-01, -1.44980242e+00, -5.28099111e-02,
       -2.47122007e+00, -3.16341736e-01,  3.15926351e+00,  6.69229836e-01,
        4.36273981e-01,  1.81728123e-01,  2.93557240e-01,  9.15876088e-01,
       -1.08542339e+00,  2.33451386e-02, -2.54371014e-01,  5.73431306e-01,
       -4.98766440e-01, -4.43452364e-02,  9.16294715e-01, -1.37973758e+00,
        3.94878980e-01, -1.43499920e-01, -1.42937113e+00, -8.32262745e-01,
       -1.37884054e+00,  2.18472495e-01, -2.16048096e-01,  5.88649323e-01,
        1.00166372e+00, -8.71651791e-02,  2.53702497e-01, -2.12706828e-01,
       -7.24315375e-01, -3.49564564e-01, -1.17281029e+00, -8.45834962e-01,
       -2.55370912e-02, -1.32283632e-01,  1.52269267e-01,  1.28947110e+00,
        1.09541928e-01,  1.52496134e-01,  8.03191722e-01, -1.63937899e+00,
        1.68251157e+00, -1.50751678e+00,  4.02501904e-01, -1.20786992e+00,
        5.16352242e-01, -7.11006182e-01,  1.19312185e+00,  6.81603130e-01,
       -8.46795424e-02,  1.83315497e-01,  2.48400930e-01,  5.78974271e-01,
        1.69399097e+00, -6.56988869e-01, -1.68774214e+00,  2.13264191e-01,
       -1.51509813e-01,  1.09199296e-01,  1.72341294e-02,  1.35118164e+00,
       -4.74745301e-01,  7.45440144e-01, -4.37212871e-01,  8.38435080e-01,
       -4.67748179e-02, -1.13199792e+00,  4.35872279e-01, -7.56488973e-01,
        6.94568222e-01, -3.06341622e-01,  5.94177451e-01,  2.36444695e+00,
        1.76328423e+00, -1.03297877e+00,  8.09375812e-01, -9.59042266e-02,
        5.18193778e-01,  4.06201429e-01,  2.35592813e-01, -1.13341274e-01,
        3.93028483e-01, -6.50817649e-01, -9.65296270e-01, -6.88512213e-02,
        1.16474002e-01,  1.28828882e+00, -1.84726191e+00,  7.03569898e-01,
       -8.12135795e-01, -1.18712915e-01, -2.50009327e-01, -1.86598849e-01,
       -7.46323891e-01,  1.95720003e-01, -5.30105761e-01,  2.80196750e+00,
       -1.23409998e+00,  8.13504178e-01, -1.34177888e+00,  5.11150712e-01,
       -2.93191136e-01,  8.44802176e-01, -1.04123131e+00,  3.45318968e-01,
        1.97332185e+00, -5.14526338e-01, -1.34242313e+00, -6.60751665e-02,
       -2.08761569e-01, -3.55510871e-01, -4.21325400e-01,  9.35617140e-02,
       -2.25302634e-01, -1.24854512e+00,  3.92293487e-01, -1.09687307e+00,
       -7.79853875e-01, -1.89571194e+00, -3.76143749e-01, -8.54801579e-04,
        1.01414670e-01,  2.37701786e+00, -3.64769502e-01,  1.74652783e-01,
        2.80644553e+00, -8.27473295e-01, -1.74264489e-02,  9.98457144e-02,
        1.27553164e+00,  1.21322128e+00,  1.07378201e+00,  1.36517117e-01,
       -7.46005585e-01,  7.38638324e-01,  1.01669138e+00, -4.15267904e-01,
        1.77916291e-01, -1.15752466e+00, -1.03874031e+00, -4.14141587e-01,
        7.95048893e-01, -1.26249458e+00, -1.11050055e+00,  5.98243246e-02,
       -1.96006555e+00,  1.25160731e+00, -5.26808247e-01,  1.98564136e+00,
       -5.23723390e-01,  7.33095032e-01, -1.00373120e-01, -2.74284282e-01,
       -4.16827170e-01, -3.30757136e-01,  1.60171702e-02, -4.84722972e-01,
        9.84382322e-01,  5.06545940e-01,  4.92309706e-01, -8.63917575e-01,
       -1.80914089e+00, -1.45579476e-01, -9.54152143e-01, -1.11179759e+00,
        2.19249087e+00,  2.05943031e-01,  2.93400791e-01,  1.72318203e-01,
       -1.50441986e-01,  1.62820164e-01, -6.95675545e-01,  2.49973469e-01,
       -1.30145138e+00,  6.82533540e-01,  2.45687863e-01, -4.98057609e-01,
        6.55504003e-01,  7.48683178e-01, -1.00049466e+00,  5.98782634e-01,
        1.13344324e+00,  8.37469302e-01, -3.75307248e-01, -6.43326535e-01,
       -5.18095943e-01,  3.87892650e-02, -1.02020562e+00, -1.58587644e-01,
        3.90924279e-01, -1.10795567e+00, -1.10392270e+00,  7.94082076e-01,
       -1.26780266e+00,  2.63818718e+00, -3.43033814e-01, -4.01349371e-01,
        1.32069589e+00,  1.62480602e+00,  1.34472552e+00, -3.35832786e-01,
       -8.06023161e-01,  1.36931710e+00, -1.36052275e+00, -7.04450525e-01,
       -4.25388807e-01,  9.08995967e-01, -3.65310507e-01,  1.03946072e-01,
        3.44039082e-01, -3.94496849e-03,  1.06691963e+00, -1.03123498e+00,
        5.86958795e-01, -8.27115872e-01,  2.58852049e-01, -6.08134062e-01,
        1.03016998e+00, -6.76502864e-01,  8.94039370e-01, -9.28066338e-01,
       -4.08443687e-01, -1.15399487e+00,  5.63144911e-01,  3.49346378e-01,
       -5.67238248e-01, -6.02634961e-01,  5.91460571e-01,  1.60903974e+00,
        6.64673704e-01,  2.11477508e-01, -4.09665199e-01, -1.34631031e-01,
       -4.49285847e-01, -2.41039017e-01, -3.74113158e-01,  4.34591090e-01,
        5.82551713e-02,  1.33084588e+00,  4.46145944e-01,  2.72761733e-01,
        1.80343147e-01,  1.99649061e+00,  5.70930089e-01, -2.18513315e-02,
       -9.17541096e-01, -3.64465339e-01, -1.52734826e+00,  4.94108188e-01,
        1.37958728e+00, -7.49316771e-01,  8.25612281e-01,  2.12430090e-01,
       -1.55288956e+00, -4.55266194e-01, -5.27143110e-01,  3.99251637e-01,
        9.90417949e-01, -2.62791893e-01, -9.44932493e-01, -8.03156228e-01,
       -1.42188222e+00, -1.17431655e-01,  3.57400310e-01, -8.67062951e-01,
       -6.74848534e-01,  1.37118850e+00, -1.24093443e+00,  3.07936234e-01,
        6.39403233e-01,  1.48385159e-01, -4.24008082e-01,  1.16355542e+00,
        5.79217405e-01, -7.77744133e-01, -9.13255598e-01,  9.05847145e-01,
        1.67293618e-02,  2.46708727e-01, -1.11898247e+00, -9.16449775e-01,
       -5.22453461e-01, -1.21264669e+00, -1.10409059e+00,  1.57686409e+00,
       -2.37033795e+00, -1.02455788e+00, -3.00481959e-01, -8.50656319e-02,
        9.76937401e-02, -1.25697503e+00,  1.42000544e+00,  6.92604216e-01,
        9.86430764e-01,  2.88952058e-01,  2.49687890e-02,  1.14511709e+00,
       -3.48260732e-01,  8.71174752e-01, -1.56757408e+00,  3.89894859e-01,
       -3.29199202e-01, -6.55862185e-01, -1.85683322e-01,  1.11647705e-01,
        6.50652078e-01,  1.63142041e+00,  3.77613738e-01, -1.40914363e+00,
        9.19528043e-01, -1.90084173e+00,  1.61880169e+00,  1.17916306e+00,
       -5.12238257e-01, -1.07854956e+00, -2.65216672e-01,  3.49050418e-01,
       -1.08887098e+00,  1.84366665e-02, -4.42465291e-03, -1.50819380e+00,
        1.64202761e+00, -2.24401740e-01, -1.59601303e+00, -1.48729367e+00,
        1.26888161e+00,  6.38915048e-01,  8.91710413e-01,  1.39670885e+00,
       -1.14858772e+00,  8.45429731e-01,  8.37744089e-01,  5.58744760e-01,
       -5.86442253e-01,  3.62685995e-01,  1.23190113e+00,  5.30650697e-01,
        4.06520524e-01,  2.36487919e-01,  4.89562402e-01, -1.27142201e+00,
        5.07684301e-01,  1.65667575e+00, -5.53668421e-01,  3.81369025e-01,
       -3.15029147e-01, -8.43854438e-01,  4.32184318e-01, -1.13908325e+00,
        1.17251121e+00, -6.42982942e-01,  1.62665466e+00,  3.09349891e-01,
        2.69908592e-01, -1.26433249e-01, -3.61438455e-01, -1.56592388e+00,
       -4.64068579e-01,  7.62853583e-01, -8.60091488e-01,  6.67510977e-01,
       -1.55158313e-01,  1.14411363e+00, -6.79497115e-01, -1.89717512e+00,
       -1.36778167e-01,  3.51292047e-01,  1.32206578e+00, -1.48757096e-01,
       -1.62531123e-01, -1.77573326e+00, -5.79329201e-01,  4.28031657e-01,
       -1.18376870e+00,  1.11969852e+00, -3.06446115e-01,  4.23766555e-01,
       -1.80460942e+00,  1.07733268e+00, -2.33926793e+00, -9.82872816e-02,
        8.83341580e-03,  4.21423055e-01, -5.69393524e-01,  2.74975377e-01,
       -3.46913344e-01, -3.14463605e-01, -2.69861348e-01,  5.81660623e-01,
        1.85865020e+00,  1.00857401e+00, -2.25913362e+00, -3.74882871e-01,
       -4.76319750e-02, -2.05392758e+00,  1.00139194e+00,  3.78318727e-01,
        9.44069922e-02,  2.23001818e-01,  5.12190094e-01,  6.73072667e-01,
       -7.03855279e-01,  3.85414227e-01,  9.64143118e-01, -2.22409565e-01,
        9.55626221e-01, -8.53996096e-01, -7.44384259e-01, -4.63367321e-01,
       -1.84264754e+00,  2.13182140e+00, -1.77584406e-01, -6.33503906e-01])

In [74]:
qucut = pd.qcut(data,5) # the integer in qcut gives the number of intervals the data will be divided in

In [75]:
qucut

[(-0.267, 0.252], (-0.86, -0.267], (0.252, 0.839], (0.839, 3.243], (0.252, 0.839], ..., (-0.86, -0.267], (-3.638, -0.86], (0.839, 3.243], (-0.267, 0.252], (-0.86, -0.267]]
Length: 1000
Categories (5, interval[float64]): [(-3.638, -0.86] < (-0.86, -0.267] < (-0.267, 0.252] < (0.252, 0.839] < (0.839, 3.243]]

In [76]:
pd.value_counts(qucut)

(-3.638, -0.86]    200
(-0.86, -0.267]    200
(-0.267, 0.252]    200
(0.252, 0.839]     200
(0.839, 3.243]     200
dtype: int64

### Detecting and Filtering Outliers

In [77]:
daae = pd.DataFrame(np.random.standard_normal((1000,6)))

In [78]:
daae

            0         1         2         3         4         5
0    0.532021 -0.564124  1.576131  0.657895 -1.361864  0.027007
1   -1.983539  0.245271 -2.137079  0.428326  0.964720  0.170698
2   -0.325173 -2.003997  1.779440 -0.770938 -1.079025  0.301320
3    0.392349 -2.099110 -0.308825  0.180912 -0.061064  0.911710
4   -1.899468 -0.605579 -0.860374  0.363094 -1.059297 -1.518650
..        ...       ...       ...       ...       ...       ...
995 -0.047619 -0.085251  1.741490 -0.020452  1.220541  0.889056
996  0.728771  0.460518 -1.141419 -0.993012 -1.280424  0.795004
997  0.062766  1.015451 -0.543865  0.464998  0.081717 -0.718523
998  1.090665 -0.064472 -0.784449  0.242435  0.632528 -0.911609
999  0.978104  1.539126  0.703022 -0.647202 -0.943231 -0.198111

[1000 rows x 6 columns]

In [79]:
daae.describe()

,0,1,2,3,4,5
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,0.022291,-0.041095,0.001347,0.010711,-0.003475,0.001742
std,0.983520,0.987163,0.995956,1.003207,0.999132,0.998844
min,-2.606916,-3.130359,-3.330615,-3.031643,-2.848881,-2.669704
25%,-0.690617,-0.734244,-0.628401,-0.679015,-0.702167,-0.723079
50%,0.027882,-0.048151,-0.015358,-0.001925,-0.036632,0.066115
75%,0.675383,0.641451,0.684023,0.658622,0.668831,0.676955
max,3.634760,3.292015,3.446161,3.187873,3.311595,3.161179

In [80]:
# Suppose you want to get values greater than 3 in all or all columns

In [81]:
col2 = daae[2]

In [82]:
col2

0      1.576131
1     -2.137079
2      1.779440
3     -0.308825
4     -0.860374
         ...
995    1.741490
996   -1.141419
997   -0.543865
998   -0.784449
999    0.703022
Name: 2, Length: 1000, dtype: float64

In [83]:
col2[col2.abs()>3]

31     3.001859
360    3.446161
821   -3.330615
Name: 2, dtype: float64

In [84]:
daae[(daae.abs()>3).any(axis = 'columns')]

            0         1         2         3         4         5
22   0.203492 -1.417809 -0.195756  0.113927  3.202787 -0.792078
31  -1.545937 -1.621729  3.001859 -1.574427  0.559231 -0.254497
40  -0.486877 -0.225681  0.462186 -0.031665  3.004295 -0.187341
268 -1.732164 -0.049612 -0.042245  0.261892  3.311595  0.962413
272  3.634760  0.977452  0.916349 -0.028764  0.323941  1.883188
314 -1.032116 -1.470619 -1.315729 -0.798319 -0.400952  3.161179
316  1.068838 -0.012093  1.230925 -0.864605  3.094846  0.592033
358  1.642390 -0.308021 -0.318929  3.187873  1.213606 -0.182109
360  1.011217 -1.067225  3.446161  0.672969 -0.210942  0.681059
414  3.499722 -0.040889  1.305524 -0.156122 -0.010781  0.008744
483  3.213303 -0.294323  1.961119 -0.455660 -0.186384 -1.524296
527 -0.229298  3.292015  0.907822  0.810637 -0.069565  0.718151
549  0.550057 -3.130359 -0.583040  1.110041 -2.299657  0.355846
679  1.098994  1.139971 -1.015784 -3.031643 -2.051456  0.467415
821  1.045467 -0.972737 -3.330615  1.474960  0.439714 -1.619675

In [85]:

np.sign(data)

array([ 1., -1.,  1.,  1.,  1., -1., -1.,  1., -1.,  1.,  1.,  1., -1.,
       -1.,  1.,  1.,  1., -1., -1., -1.,  1., -1.,  1.,  1.,  1.,  1.,
        1.,  1.,  1., -1.,  1., -1., -1., -1., -1., -1., -1., -1., -1.,
        1.,  1.,  1.,  1., -1.,  1.,  1.,  1., -1., -1., -1.,  1., -1.,
       -1., -1.,  1.,  1., -1.,  1., -1.,  1.,  1., -1.,  1.,  1., -1.,
        1.,  1.,  1.,  1., -1., -1., -1., -1.,  1.,  1.,  1.,  1.,  1.,
        1., -1., -1., -1.,  1.,  1., -1., -1., -1., -1., -1., -1.,  1.,
       -1.,  1.,  1.,  1., -1.,  1., -1.,  1.,  1.,  1.,  1.,  1., -1.,
       -1., -1.,  1.,  1.,  1., -1., -1., -1., -1.,  1., -1., -1., -1.,
        1.,  1.,  1.,  1.,  1., -1., -1., -1.,  1., -1., -1., -1., -1.,
        1.,  1.,  1., -1., -1.,  1., -1.,  1.,  1., -1.,  1.,  1.,  1.,
       -1.,  1., -1., -1., -1.,  1., -1., -1., -1.,  1.,  1.,  1.,  1.,
        1.,  1., -1., -1.,  1.,  1., -1.,  1.,  1., -1.,  1., -1., -1.,
        1., -1.,  1.,  1., -1.,  1., -1.,  1., -1., -1.,  1., -1., -1.,
       -1., -1., -1.,  1., -1.,  1.,  1., -1.,  1.,  1.,  1.,  1.,  1.,
       -1.,  1., -1., -1.,  1., -1., -1.,  1.,  1.,  1., -1., -1.,  1.,
       -1.,  1.,  1.,  1.,  1.,  1.,  1., -1., -1., -1.,  1.,  1., -1.,
       -1.,  1.,  1., -1., -1., -1.,  1.,  1., -1.,  1., -1.,  1., -1.,
       -1.,  1.,  1., -1.,  1., -1.,  1., -1., -1., -1., -1.,  1.,  1.,
        1.,  1.,  1.,  1., -1., -1.,  1.,  1.,  1., -1.,  1., -1.,  1.,
        1.,  1., -1., -1.,  1., -1.,  1.,  1., -1., -1.,  1., -1., -1.,
       -1.,  1., -1., -1.,  1., -1.,  1.,  1.,  1., -1., -1.,  1.,  1.,
        1., -1.,  1.,  1.,  1., -1.,  1., -1., -1., -1.,  1., -1., -1.,
       -1.,  1.,  1.,  1., -1.,  1.,  1., -1., -1.,  1., -1., -1.,  1.,
        1.,  1.,  1., -1.,  1.,  1.,  1., -1.,  1.,  1., -1., -1., -1.,
       -1.,  1., -1., -1., -1., -1., -1., -1.,  1., -1.,  1., -1., -1.,
       -1.,  1., -1., -1., -1., -1.,  1.,  1., -1., -1.,  1., -1., -1.,
        1., -1., -1.,  1., -1., -1., -1., -1., -1., -1.,  1., -1., -1.,
        1.,  1., -1., -1.,  1.,  1., -1., -1., -1., -1.,  1., -1., -1.,
        1., -1.,  1.,  1., -1., -1.,  1., -1., -1.,  1., -1.,  1., -1.,
       -1.,  1., -1.,  1.,  1.,  1.,  1.,  1., -1.,  1., -1.,  1., -1.,
       -1.,  1.,  1.,  1.,  1.,  1.,  1., -1.,  1.,  1.,  1., -1.,  1.,
       -1.,  1., -1., -1.,  1.,  1.,  1., -1.,  1.,  1., -1., -1., -1.,
        1.,  1., -1., -1., -1.,  1.,  1., -1.,  1., -1., -1.,  1., -1.,
        1., -1.,  1., -1., -1., -1.,  1., -1.,  1.,  1.,  1.,  1.,  1.,
        1.,  1., -1., -1.,  1.,  1.,  1., -1., -1.,  1.,  1., -1., -1.,
       -1.,  1.,  1.,  1., -1., -1., -1.,  1., -1., -1.,  1.,  1.,  1.,
       -1., -1., -1.,  1.,  1., -1., -1., -1.,  1.,  1., -1., -1., -1.,
       -1.,  1., -1., -1., -1.,  1., -1., -1.,  1., -1., -1., -1.,  1.,
       -1.,  1.,  1., -1., -1., -1.,  1., -1., -1.,  1.,  1., -1., -1.,
        1., -1.,  1.,  1.,  1., -1., -1.,  1.,  1.,  1., -1.,  1.,  1.,
        1.,  1., -1., -1.,  1., -1., -1.,  1.,  1.,  1., -1.,  1., -1.,
        1.,  1.,  1.,  1., -1.,  1.,  1., -1.,  1., -1., -1.,  1., -1.,
        1., -1., -1.,  1.,  1., -1.,  1.,  1.,  1., -1., -1., -1.,  1.,
       -1., -1.,  1., -1.,  1.,  1.,  1., -1.,  1.,  1., -1.,  1., -1.,
       -1., -1., -1., -1., -1.,  1.,  1.,  1.,  1.,  1.,  1., -1.,  1.,
       -1.,  1., -1., -1.,  1., -1.,  1., -1., -1., -1., -1.,  1., -1.,
        1.,  1., -1.,  1., -1., -1., -1., -1., -1., -1., -1.,  1.,  1.,
        1.,  1.,  1., -1.,  1., -1.,  1., -1.,  1., -1.,  1.,  1., -1.,
        1.,  1.,  1.,  1., -1., -1.,  1., -1.,  1.,  1.,  1., -1.,  1.,
       -1.,  1., -1., -1.,  1., -1.,  1., -1.,  1.,  1.,  1., -1.,  1.,
       -1.,  1.,  1.,  1., -1.,  1., -1., -1., -1.,  1.,  1., -1.,  1.,
       -1., -1., -1., -1., -1.,  1., -1.,  1., -1.,  1., -1.,  1., -1.,
        1., -1.,  1.,  1., -1., -1., -1., -1., -1., -1.,  1., -1., -1.,
        1., -1., -1., -1., -1., -1.,  1.,  1., -1.,  1.,  1., -1., -1.,
        1.,  1.,  1.,  1.,  1., -1.,  1.,  1., -1.,  1., -1., -1., -1.,
        1., -1., -1.,  1., -1.,  1., -1.,  1., -1.,  1., -1., -1., -1.,
       -1.,  1., -1.,  1.,  1.,  1., -1., -1., -1., -1., -1.,  1.,  1.,
        1.,  1., -1.,  1., -1.,  1., -1.,  1.,  1., -1.,  1.,  1., -1.,
        1.,  1.,  1., -1., -1., -1.,  1., -1., -1.,  1., -1., -1.,  1.,
       -1.,  1., -1., -1.,  1.,  1.,  1., -1., -1.,  1., -1., -1., -1.,
        1., -1.,  1.,  1., -1.,  1., -1.,  1., -1.,  1., -1.,  1., -1.,
        1., -1., -1., -1.,  1.,  1., -1., -1.,  1.,  1.,  1.,  1., -1.,
       -1., -1., -1., -1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1., -1.,
       -1., -1., -1.,  1.,  1., -1.,  1.,  1., -1., -1., -1.,  1.,  1.,
       -1., -1., -1., -1., -1.,  1., -1., -1.,  1., -1.,  1.,  1.,  1.,
       -1.,  1.,  1., -1., -1.,  1.,  1.,  1., -1., -1., -1., -1., -1.,
        1., -1., -1., -1., -1.,  1., -1.,  1.,  1.,  1.,  1.,  1.,  1.,
       -1.,  1., -1.,  1., -1., -1., -1.,  1.,  1.,  1.,  1., -1.,  1.,
       -1.,  1.,  1., -1., -1., -1.,  1., -1.,  1., -1., -1.,  1., -1.,
       -1., -1.,  1.,  1.,  1.,  1., -1.,  1.,  1.,  1., -1.,  1.,  1.,
        1.,  1.,  1.,  1., -1.,  1.,  1., -1.,  1., -1., -1.,  1., -1.,
        1., -1.,  1.,  1.,  1., -1., -1., -1., -1.,  1., -1.,  1., -1.,
        1., -1., -1., -1.,  1.,  1., -1., -1., -1., -1.,  1., -1.,  1.,
       -1.,  1., -1.,  1., -1., -1.,  1.,  1., -1.,  1., -1., -1., -1.,
        1.,  1.,  1., -1., -1., -1., -1.,  1.,  1.,  1.,  1.,  1.,  1.,
       -1.,  1.,  1., -1.,  1., -1., -1., -1., -1.,  1., -1., -1.])

In [86]:
daae[daae.abs()>3] = np.sign(daae)  # ye part utna nahi samjha like np.sign(daae) normal chalao toh upar ke block wala
# output aata hai, and jab ye karo daae[(daae.abs()>3)] = np.sign(daae) toh change ho jaata hai jabki apan np.sign(daae) ka value
# daae[(daae.abs()>3)] ko de rahe hai par np.sign(daae) yahi change ho jaa raha hai

In [87]:
np.sign(daae)

       0    1    2    3    4    5
0    1.0 -1.0  1.0  1.0 -1.0  1.0
1   -1.0  1.0 -1.0  1.0  1.0  1.0
2   -1.0 -1.0  1.0 -1.0 -1.0  1.0
3    1.0 -1.0 -1.0  1.0 -1.0  1.0
4   -1.0 -1.0 -1.0  1.0 -1.0 -1.0
..   ...  ...  ...  ...  ...  ...
995 -1.0 -1.0  1.0 -1.0  1.0  1.0
996  1.0  1.0 -1.0 -1.0 -1.0  1.0
997  1.0  1.0 -1.0  1.0  1.0 -1.0
998  1.0 -1.0 -1.0  1.0  1.0 -1.0
999  1.0  1.0  1.0 -1.0 -1.0 -1.0

[1000 rows x 6 columns]

In [88]:
daae[daae.abs()>3]

      0   1   2   3   4   5
0   NaN NaN NaN NaN NaN NaN
1   NaN NaN NaN NaN NaN NaN
2   NaN NaN NaN NaN NaN NaN
3   NaN NaN NaN NaN NaN NaN
4   NaN NaN NaN NaN NaN NaN
..   ..  ..  ..  ..  ..  ..
995 NaN NaN NaN NaN NaN NaN
996 NaN NaN NaN NaN NaN NaN
997 NaN NaN NaN NaN NaN NaN
998 NaN NaN NaN NaN NaN NaN
999 NaN NaN NaN NaN NaN NaN

[1000 rows x 6 columns]

### Permutation and Random Sampling

In [89]:
daa = pd.DataFrame(np.arange(35).reshape((5,7)))

daa

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [90]:
xample = np.random.permutation(5)

xample

array([1, 2, 0, 3, 4])

In [91]:
daa.take(xample) # by default it will print value row wise only

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [92]:
daa.iloc[xample]

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [93]:
daa.sample(n = 5,replace = False) # You can pass replace = True if you want to repeat the row values

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27

In [94]:
daa.sample(n = 5,axis = 'columns')

    2   5   1   4   0
0   2   5   1   4   0
1   9  12   8  11   7
2  16  19  15  18  14
3  23  26  22  25  21
4  30  33  29  32  28

In [95]:
daa.take(xample,axis = 'columns')

    1   2   0   3   4
0   1   2   0   3   4
1   8   9   7  10  11
2  15  16  14  17  18
3  22  23  21  24  25
4  29  30  28  31  32

### Computing Indicator / Dummy Variables

In [96]:
sf = pd.DataFrame({'kiss':['b','b','a','c','a','b'],'datta':range(6)})

sf

  kiss  datta
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    b      5

In [97]:
op = pd.get_dummies(sf['kiss'])  # So basically what this does is that it will give 1 for the value present in the columns and on the particular index

op

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

#### You can also add some prefix

In [98]:
dummy = pd.get_dummies(sf['kiss'],prefix = 'manu')

dummy # You have only given manu, (_) part has been added by the function

   manu_a  manu_b  manu_c
0       0       1       0
1       0       1       0
2       1       0       0
3       0       0       1
4       1       0       0
5       0       1       0

In [99]:
# little imp join function


out = sf[['kiss']].join(dummy)

out

  kiss  manu_a  manu_b  manu_c
0    b       0       1       0
1    b       0       1       0
2    a       1       0       0
3    c       0       0       1
4    a       1       0       0
5    b       0       1       0

In [100]:
out = sf[['datta']].join(dummy)

out

   datta  manu_a  manu_b  manu_c
0      0       0       1       0
1      1       0       1       0
2      2       1       0       0
3      3       0       0       1
4      4       1       0       0
5      5       0       1       0

In [101]:
print(o.getcwd())

C:\Users\manas\PycharmProjects\wes mckinney

In [102]:
mnames = ['movie_id','title','genres']

In [103]:
# Now in the below written code understand fewthings, first is the read_table funtion, this is used to read DAT file
# next is the sep part, it works like the split() function, it will look for the parameter that you passed and will
# divide the file contents accordingly
# Header ka use nahi pata utna

In [104]:
movies = pd.read_table('datasets/movielens/movies.dat',sep = '::',
                      header = None, names = mnames,engine = 'python'
                      )

movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [105]:
# movies = pd.read_table('datasets/movielens/movies.dat',sep = '::',
#                       header = 123, names = mnames,engine = 'python'
#                       )

# movies

In [106]:
# Special function str.get_dummies()

In [107]:
new_dummy  = movies['genres'].str.get_dummies('|') # So this is nice right, it took the separator also and worked
new_dummy

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [108]:
movie_new = movies.join(new_dummy.add_prefix('MeraMovie'))


movie_new

,movie_id,title,genres,MeraMovieAction,MeraMovieAdventure,MeraMovieAnimation,MeraMovieChildren's,MeraMovieComedy,MeraMovieCrime,MeraMovieDocumentary,...,MeraMovieFantasy,MeraMovieFilm-Noir,MeraMovieHorror,MeraMovieMusical,MeraMovieMystery,MeraMovieRomance,MeraMovieSci-Fi,MeraMovieThriller,MeraMovieWar,MeraMovieWestern
0,1,Toy Story (1995),Animation|Children's|Comedy,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0,1,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),Comedy|Romance,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),Comedy|Drama,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Father of the Bride Part II (1995),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3879,3949,Requiem for a Dream (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3880,3950,Tigerland (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3881,3951,Two Family House (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3882,3952,"Contender, The (2000)",Drama|Thriller,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [109]:
movie_new.iloc[0]

movie_id                                          1
title                              Toy Story (1995)
genres                  Animation|Children's|Comedy
MeraMovieAction                                   0
MeraMovieAdventure                                0
MeraMovieAnimation                                1
MeraMovieChildren's                               1
MeraMovieComedy                                   1
MeraMovieCrime                                    0
MeraMovieDocumentary                              0
MeraMovieDrama                                    0
MeraMovieFantasy                                  0
MeraMovieFilm-Noir                                0
MeraMovieHorror                                   0
MeraMovieMusical                                  0
MeraMovieMystery                                  0
MeraMovieRomance                                  0
MeraMovieSci-Fi                                   0
MeraMovieThriller                                 0
MeraMovieWar                                      0
MeraMovieWestern                                  0
Name: 0, dtype: object

In [110]:
# While this method is good, it is not that fast. It's best to combine it with numpy

In [111]:
np.random.seed(1000)

vela = np.random.uniform(size = 10)

vela

array([0.65358959, 0.11500694, 0.95028286, 0.4821914 , 0.87247454,
       0.21233268, 0.04070962, 0.39719446, 0.2331322 , 0.84174072])

In [112]:
binner = [0,0.2,0.4,0.6,0.8,1]

In [113]:
oss = pd.get_dummies(pd.cut(vela,binner))

oss

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           1           0
1           1           0           0           0           0
2           0           0           0           0           1
3           0           0           1           0           0
4           0           0           0           0           1
5           0           1           0           0           0
6           1           0           0           0           0
7           0           1           0           0           0
8           0           1           0           0           0
9           0           0           0           0           1

### Extension Datatypes

##### This was mainly developed to handle the shortcomings of Numpy based operations that lacked at handling missing values
##### As the missing valuer were mostly converted to np.nan that was of float or int type depending on the data type of other values
##### The extension data types also reduce the computational power required for string based data with missing values

In [114]:
s = pd.Series([1,3,2,112,None])
s

0      1.0
1      3.0
2      2.0
3    112.0
4      NaN
dtype: float64

In [115]:
s.dtype

dtype('float64')

In [116]:
s = pd.Series([1,3,2,112,None],dtype = pd.Int64Dtype()) # Now this is extension based typecasting
s

0       1
1       3
2       2
3     112
4    <NA>
dtype: Int64

In [117]:
# You can do this for string now

In [118]:
ss = pd.Series(['one','two','three',None,'chaar'])

ss

0      one
1      two
2    three
3     None
4    chaar
dtype: object

In [119]:
ss = pd.Series(['one','two','three',None,'chaar'], dtype = pd.StringDtype())

ss

0      one
1      two
2    three
3     <NA>
4    chaar
dtype: string

In [120]:
abc = pd.DataFrame({'A':[1,2,None,4],
                   'B':['one','two','three',None],
                    'C':[False,None,False,True]
                   
                   })

abc

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [121]:
abc['A'] = abc['A'].astype(pd.Int64Dtype())

abc['B'] = abc['B'].astype(pd.StringDtype())

abc['C'] = abc['C'].astype(pd.BooleanDtype())

abc

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

## String Manipulation

## Regular Expression

In [122]:
rr = "fii  hhee        aaha    naah"

# 1st method

print(re.split(r"\s+",rr)) # \s+ is the describer for splitting expression that has multiple whitespaces



regex = re.compile(r"\s+") # What you have done here is made an object of re.compile(r"\s+") which you can use for working

# on multiple strings

['fii', 'hhee', 'aaha', 'naah']

In [123]:
text = """

Charlie char007.ted@google.com
Jobie job@google.com
shubhu shub@google.com
Debu debs@google.com

"""


pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{1,4}"


# Now, let's understand the pattern

# 1st [A-Z0-9._%+-] check if the pattern has  A to Z or 0 to 9 and if it contains ._%+-

# 2nd @[A-Z0-9.-] the next part in string should start with @ and has  A to Z or 0 to 9 and if it contains .-

# 3rd \.[A-Z]{1,4} the next part should start with . and A to Z and min length should be 1 and max len be 4


regex = re.compile(pattern,flags = re.IGNORECASE)


regex.findall(text)

['char007.ted@google.com',
 'job@google.com',
 'shub@google.com',
 'debs@google.com']

In [124]:
regex.findall(text)

['char007.ted@google.com',
 'job@google.com',
 'shub@google.com',
 'debs@google.com']

#### Sub method

In [125]:
print(regex.sub(r"SHIT IS REAL",text)) # basically substitute it for something else

Charlie SHIT IS REAL
Jobie SHIT IS REAL
shubhu SHIT IS REAL
Debu SHIT IS REAL

In [126]:
# Suppose you wanted to divide the data that you get, or like print it in a specific way, then pass the pattern in tuples

In [127]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{1,4})"

In [128]:

regex = re.compile(pattern,flags = re.IGNORECASE)


regex.findall(text)

[('char007.ted', 'google', 'com'),
 ('job', 'google', 'com'),
 ('shub', 'google', 'com'),
 ('debs', 'google', 'com')]

In [129]:
# Also to print in a special way

In [130]:
print(regex.sub(r"Naam:- \1 , Kaam:- \2 , Daam:- \3 ",text))

Charlie Naam:- char007.ted , Kaam:- google , Daam:- com
Jobie Naam:- job , Kaam:- google , Daam:- com
shubhu Naam:- shub , Kaam:- google , Daam:- com
Debu Naam:- debs , Kaam:- google , Daam:- com

## String functions in Pandas

In [131]:
data = {'Charlie': 'char007.ted@google.com',
'Jobie': 'job@shitter.com',
'shubhu' : 'shub@simp.com',
'Debu' : 'debs@google.com',
'wes' : np.nan
        
}

In [132]:
datte = pd.Series(data)

datte

Charlie    char007.ted@google.com
Jobie             job@shitter.com
shubhu              shub@simp.com
Debu              debs@google.com
wes                           NaN
dtype: object

In [133]:
# To check if the string contains a particular expression

In [134]:
datte.str.contains('google')

Charlie     True
Jobie      False
shubhu     False
Debu        True
wes          NaN
dtype: object

In [135]:
# Now to do string processing even better we will use extension type

In [136]:
dattext = datte.astype('string')

In [137]:
dattext

Charlie    char007.ted@google.com
Jobie             job@shitter.com
shubhu              shub@simp.com
Debu              debs@google.com
wes                          <NA>
dtype: string

In [138]:
dattext.str.contains('google')

Charlie     True
Jobie      False
shubhu     False
Debu        True
wes         <NA>
dtype: boolean

In [139]:
# You can use regular expression as well

In [140]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{1,4})"

In [141]:
# Here we will apply regular expression in a little differnt format


dattext.str.findall(pattern,flags = re.IGNORECASE)

Charlie    [(char007.ted, google, com)]
Jobie             [(job, shitter, com)]
shubhu              [(shub, simp, com)]
Debu              [(debs, google, com)]
wes                                <NA>
dtype: object

In [142]:
# Now you can use the extract method and use the regular expression output as a DataFrame

In [143]:
dattext.str.extract(pattern,flags = re.IGNORECASE)

                   0        1     2
Charlie  char007.ted   google   com
Jobie            job  shitter   com
shubhu          shub     simp   com
Debu            debs   google   com
wes             <NA>     <NA>  <NA>

## Categorical Data

### Background and Motivation

In [144]:
values = pd.Series(['apple','orange','apple','apple'] * 2)

values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [145]:
print(pd.unique(values))


pd.value_counts(values)

['apple' 'orange']

apple     6
orange    2
dtype: int64

In [146]:
values = pd.Series([0,1,2,0,2,2,2,2,0,1,1,2,1,1])

dii = pd.Series(['apple','orange','kaju katli'])

In [147]:
dii.take(values) # So how this works is that for every number change in values, it look for a change in dii and map it accordingly

0         apple
1        orange
2    kaju katli
0         apple
2    kaju katli
2    kaju katli
2    kaju katli
2    kaju katli
0         apple
1        orange
1        orange
2    kaju katli
1        orange
1        orange
dtype: object

## Categorical Extension Type in pandas

In [148]:
# Now, the use of this is that it saves space while storage as it will map the string values to integer values

# Like, if there are 3 different string values, the value stored in it will be 0,1,2

In [149]:
B = ['apple','orange','apple','apple','kaju katli','apple','kaju katli','kaju katli','orange','orange'] *2


B

['apple',
 'orange',
 'apple',
 'apple',
 'kaju katli',
 'apple',
 'kaju katli',
 'kaju katli',
 'orange',
 'orange',
 'apple',
 'orange',
 'apple',
 'apple',
 'kaju katli',
 'apple',
 'kaju katli',
 'kaju katli',
 'orange',
 'orange']

In [150]:
bl = len(B)

rnd = np.random.default_rng(seed = 123)

print(bl)

rnd

20

Generator(PCG64) at 0x1BE51270958

In [151]:
fruit_ninja = pd.DataFrame({'Fruits':B,'basket_no':np.arange(bl),
                           'count':rnd.integers(10,23,size = bl),
                            'weight':rnd.uniform(3,6,size = bl)
                            
                           },columns = ['basket_no','Fruits','weight','count']            )


fruit_ninja

    basket_no      Fruits    weight  count
0           0       apple  4.538911     10
1           1      orange  3.734894     18
2           2       apple  5.472725     17
3           3       apple  3.641289     10
4           4  kaju katli  5.224401     21
5           5       apple  4.889821     12
6           6  kaju katli  5.782222     13
7           7  kaju katli  3.695725     12
8           8      orange  5.397375     14
9           9      orange  4.554495     12
10         10       apple  3.694667     14
11         11      orange  3.497712     20
12         12       apple  4.493367     15
13         13       apple  4.748174     22
14         14  kaju katli  3.553014     15
15         15       apple  3.044685     13
16         16  kaju katli  4.413400     20
17         17  kaju katli  5.184730     20
18         18      orange  5.755801     21
19         19      orange  4.876602     21

In [152]:
# Now to convert into category

fruit_cat = fruit_ninja['Fruits'].astype('category')

fruit_cat

0          apple
1         orange
2          apple
3          apple
4     kaju katli
5          apple
6     kaju katli
7     kaju katli
8         orange
9         orange
10         apple
11        orange
12         apple
13         apple
14    kaju katli
15         apple
16    kaju katli
17    kaju katli
18        orange
19        orange
Name: Fruits, dtype: category
Categories (3, object): ['apple', 'kaju katli', 'orange']

In [153]:
# Now, to access it and make changes accordingly we need to do it using category's array function

In [154]:
car = fruit_cat.array

car

['apple', 'orange', 'apple', 'apple', 'kaju katli', ..., 'apple', 'kaju katli', 'kaju katli', 'orange', 'orange']
Length: 20
Categories (3, object): ['apple', 'kaju katli', 'orange']

In [155]:
car.categories

Index(['apple', 'kaju katli', 'orange'], dtype='object')

In [156]:
car.codes

array([0, 2, 0, 0, 1, 0, 1, 1, 2, 2, 0, 2, 0, 0, 1, 0, 1, 1, 2, 2],
      dtype=int8)

#### Useful trick

In [157]:
# To get the mapping of the codes with the strings, do this

In [158]:
mapped = dict(enumerate(car.categories))

mapped

{0: 'apple', 1: 'kaju katli', 2: 'orange'}

In [159]:
# You can make the DataFrame columns also into categories

In [160]:
fruit_ninja['Fruits'] = fruit_ninja['Fruits'].astype('category')


fruit_ninja['Fruits']

0          apple
1         orange
2          apple
3          apple
4     kaju katli
5          apple
6     kaju katli
7     kaju katli
8         orange
9         orange
10         apple
11        orange
12         apple
13         apple
14    kaju katli
15         apple
16    kaju katli
17    kaju katli
18        orange
19        orange
Name: Fruits, dtype: category
Categories (3, object): ['apple', 'kaju katli', 'orange']

In [161]:
# You can also create one category from scratch

In [162]:
manscat = pd.Categorical(['chup','chaap','reh','chup','chup','reh'])


manscat

['chup', 'chaap', 'reh', 'chup', 'chup', 'reh']
Categories (3, object): ['chaap', 'chup', 'reh']

In [163]:
# Now if you have obtained categorical encoded data from somewhere else use from_codes

In [164]:
caw = ['chup','chaap','reh']

code = [2,1,0,1,2,1,1,2,1,2]

In [165]:
maca = pd.Categorical.from_codes(code,caw)

maca

['reh', 'chaap', 'chup', 'chaap', 'reh', 'chaap', 'chaap', 'reh', 'chaap', 'reh']
Categories (3, object): ['chup', 'chaap', 'reh']

In [166]:
# Now you can also order the categories

In [167]:
maca = pd.Categorical.from_codes(code,caw,ordered = True)

maca

['reh', 'chaap', 'chup', 'chaap', 'reh', 'chaap', 'chaap', 'reh', 'chaap', 'reh']
Categories (3, object): ['chup' < 'chaap' < 'reh']

In [168]:
# if you already have an unordered category, do this

In [169]:
messi = pd.Categorical.from_codes(code,caw)

messi

['reh', 'chaap', 'chup', 'chaap', 'reh', 'chaap', 'chaap', 'reh', 'chaap', 'reh']
Categories (3, object): ['chup', 'chaap', 'reh']

In [170]:
    messi.as_ordered()

['reh', 'chaap', 'chup', 'chaap', 'reh', 'chaap', 'chaap', 'reh', 'chaap', 'reh']
Categories (3, object): ['chup' < 'chaap' < 'reh']

### Computation with categoricals

In [171]:
# Here we will see the use of the group by and other aggregate functions

In [172]:
# First lets start with some random data

In [173]:
rands = np.random.default_rng(seed = 4000)

daws = rands.standard_normal(2000)

daws

array([-0.4696353 , -0.34941124, -1.40464869, ...,  0.61942069,
        0.59034187,  0.7252722 ])

In [174]:
# Now let's get qcut

In [175]:
oot = pd.qcut(daws,20)

oot

[(-0.487, -0.378], (-0.378, -0.249], (-1.632, -1.239], (0.0178, 0.133], (1.264, 1.642], ..., (-1.632, -1.239], (-0.988, -0.794], (0.501, 0.647], (0.501, 0.647], (0.647, 0.834]]
Length: 2000
Categories (20, interval[float64]): [(-3.302, -1.632] < (-1.632, -1.239] < (-1.239, -0.988] < (-0.988, -0.794] ... (0.834, 1.033] < (1.033, 1.264] < (1.264, 1.642] < (1.642, 3.927]]

In [176]:
# Now, to make the data more presentable first we will assign them labels and then do the group by functions

In [177]:
oot = pd.qcut(daws,20,labels = ['Q1','Q2','Q3','Q4','Q5','Q6','Q7','Q8','Q9','Q10','Q11','Q12','Q13','Q14','Q15','Q16','Q17','Q18','Q19','Q20'])

oot

['Q7', 'Q8', 'Q2', 'Q11', 'Q19', ..., 'Q2', 'Q4', 'Q15', 'Q15', 'Q16']
Length: 2000
Categories (20, object): ['Q1' < 'Q2' < 'Q3' < 'Q4' ... 'Q17' < 'Q18' < 'Q19' < 'Q20']

In [178]:
# Now to make it more presentable we will do this

In [179]:
# First we will pass the data as series

ooto = pd.Series(oot,name = 'check')

ooto

0        Q7
1        Q8
2        Q2
3       Q11
4       Q19
       ...
1995     Q2
1996     Q4
1997    Q15
1998    Q15
1999    Q16
Name: check, Length: 2000, dtype: category
Categories (20, object): ['Q1' < 'Q2' < 'Q3' < 'Q4' ... 'Q17' < 'Q18' < 'Q19' < 'Q20']

## Now here is the interesting part, although you maybe seeing the data as Q1,Q2 and so on
## Actually they are mapped to proper intervals and will assign them to values they encounter

In [180]:
pd.Series(daws)

0      -0.469635
1      -0.349411
2      -1.404649
3       0.037629
4       1.297645
          ...
1995   -1.388217
1996   -0.949673
1997    0.619421
1998    0.590342
1999    0.725272
Length: 2000, dtype: float64

In [181]:
res = (pd.Series(daws)
      .groupby(ooto)
       .agg(['count','min','max'])
       .reset_index()
      )

res

   check  count       min       max
0     Q1    100 -3.301240 -1.641030
1     Q2    100 -1.631212 -1.249216
2     Q3    100 -1.238329 -0.988348
3     Q4    100 -0.987854 -0.794725
4     Q5    100 -0.793503 -0.649379
5     Q6    100 -0.644327 -0.486804
6     Q7    100 -0.486517 -0.379919
7     Q8    100 -0.377708 -0.248883
8     Q9    100 -0.248655 -0.122205
9    Q10    100 -0.121178  0.015208
10   Q11    100  0.020414  0.133031
11   Q12    100  0.133085  0.245764
12   Q13    100  0.246942  0.357048
13   Q14    100  0.357145  0.498843
14   Q15    100  0.505783  0.645592
15   Q16    100  0.649980  0.833267
16   Q17    100  0.834934  1.032717
17   Q18    100  1.037498  1.264159
18   Q19    100  1.265072  1.642183
19   Q20    100  1.643282  3.926958

In [182]:
dda = pd.Series(['aap','ache','ho','aap','go'])

In [183]:
da = dda.astype('category')

da

0     aap
1    ache
2      ho
3     aap
4      go
dtype: category
Categories (4, object): ['aap', 'ache', 'go', 'ho']

## Categorical Methods

In [ ]:
# These are special series methods that are helpful in providing convinient access to the categories codes's

In [184]:
pdd = pd.Series(['a','v','c','k']*2)

pdd

0    a
1    v
2    c
3    k
4    a
5    v
6    c
7    k
dtype: object

In [185]:
pdd_cat = pdd.astype('category')

pdd_cat

0    a
1    v
2    c
3    k
4    a
5    v
6    c
7    k
dtype: category
Categories (4, object): ['a', 'c', 'k', 'v']

In [ ]:
# To see the code of each object,

In [186]:
pdd_cat.cat.codes

0    0
1    3
2    1
3    2
4    0
5    3
6    1
7    2
dtype: int8

In [187]:
# Suppose that we know there could be more data present and could not be seen, so we do this

In [212]:
temp_cat = ['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','w','x','v','y','z']

In [214]:
# Like we have passed an entire list of alphabets to the cat and letting them take their places correspondingly

# If you remove 'v' from list then Nan will come in its place

In [215]:
cat2 = pdd_cat.cat.set_categories(temp_cat)

cat2

0    a
1    v
2    c
3    k
4    a
5    v
6    c
7    k
dtype: category
Categories (26, object): ['a', 'b', 'c', 'd', ..., 'x', 'v', 'y', 'z']

In [200]:
# Now, the values will change

In [216]:
pdd_cat.value_counts()

a    2
c    2
k    2
v    2
dtype: int64

In [218]:
cat2.value_counts()

a    2
c    2
v    2
k    2
o    0
y    0
x    0
w    0
u    0
t    0
s    0
r    0
q    0
p    0
n    0
b    0
m    0
l    0
j    0
i    0
h    0
g    0
f    0
e    0
d    0
z    0
dtype: int64

In [217]:
# Now suppose you want to remove unused data from the category

In [219]:
cat2_un = cat2[cat2.isin(('a','v'))]

cat2_un

0    a
1    v
4    a
5    v
dtype: category
Categories (26, object): ['a', 'b', 'c', 'd', ..., 'x', 'v', 'y', 'z']

In [220]:
cat2_un.cat.remove_unused_categories()

0    a
1    v
4    a
5    v
dtype: category
Categories (2, object): ['a', 'v']

In [221]:
# Now, if you want to suppose create dummy variables for better data processing, you can do that

In [223]:
pd.get_dummies(cat2)

   a  b  c  d  e  f  g  h  i  j  ...  q  r  s  t  u  w  x  v  y  z
0  1  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
1  0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  1  0  0
2  0  0  1  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
3  0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
4  1  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
5  0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  1  0  0
6  0  0  1  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0
7  0  0  0  0  0  0  0  0  0  0  ...  0  0  0  0  0  0  0  0  0  0

[8 rows x 26 columns]